const ERROR_MAP = {
  MISS_PRODUCT_GROUP_CODE:
    'درخواست شما با خطا مواجه شده است. لطفاً دقایقی دیگر تلاش کنید. در صورت برطرف نشدن مشکل با پشتیبانی تماس بگیرید.',
  GROUP_NOT_FOUND:
    'درخواست شما با خطا مواجه شده است. لطفاً دقایقی دیگر تلاش کنید. در صورت برطرف نشدن مشکل با پشتیبانی تماس بگیرید.',
  INVALID_NATIONAL_CODE_SYNTAX: 'کد ملی وارد شده اشتباه است.',
  NATIONAL_CODE_IS_NOT_FOR_YOU:
    'این کد ملی با شماره همراه دیگری در کیان ثبت شده است. لطفاً با همان شماره همراه وارد شوید. در صورتی که فکر می‌کنید اشتباهی رخ داده است، با پشتیبانی تماس بگیرید.',
  INVALID_OTHER_RELATION_TYPE:
    'درخواست شما با خطا مواجه شده است. لطفاً دقایقی دیگر تلاش کنید. در صورت برطرف نشدن مشکل با پشتیبانی تماس بگیرید.',
  ONBOARDER_DOES_NOT_EXIST:
    'اطلاعات نماینده یافت نشد. با پشتیبانی تماس بگیرید.',
  PARTY_IS_NOT_ACTIVE_KYC:
    'شما هنوز در کارگزاری کیان احراز هویت نشده‌اید. قبل از آنکه بتوانید فرزند خود را ثبت‌نام کنید باید ابتدا خودتان در کیان ثبت‌نام کرده و احراز هویت شوید.',
  CAN_NOT_START_OTHER_FOR_HIMSELF:
    'شما قبلاً در کارگزاری کیان به عنوان شخص حقیقی اصیل ثبت‌نام کرده‌اید. شما نمی‌توانید خودتان را به عنوان فرزند ثبت‌نام کنید.',
  INVALID_ONBOARDERINVALID_ONBOARDER:
    'این کد ملی قبلاً توسط فرد دیگری در کارگزاری کیان ثبت‌نام شده است. لطفاً با شماره تلفن همراه همان فرد وارد شوید. در صورتی که فکر می‌کنید اشتباهی رخ داده است، با پشتیبانی تماس بگیرید.',
  SEJAM_SERVICE_ERROR:
    'ارتباط با سامانه سجام برقرار نشد. لطفاً دقایقی دیگر تلاش کنید. در صورت برطرف نشدن مشکل با پشتیبانی تماس بگیرید.',
  PRODUCT_ALREADY_PURCHASED: 'ثبت‌نام شما با موفقیت به پایان رسیده است. ',
  START_ONBOARDING_ERROR:
    'درخواست شما با خطا مواجه شده است. لطفاً دقایقی دیگر تلاش کنید. در صورت برطرف نشدن مشکل با پشتیبانی تماس بگیرید.',
  ONBOARDER_IS_NOT_ONBOARED:
    'شما هنوز در کارگزاری کیان ثبت‌نام نکرده‌اید. قبل از آنکه بتوانید فرزند خود را ثبت‌نام کنید باید ابتدا خودتان در کیان ثبت‌نام کرده و احراز هویت شوید.',
  422: 'شما هنوز اطلاعات لازم را به طور کامل وارد نکرده‌اید، لطفا پس از اطمینان از تکمیل اطلاعات دوباره تلاش کنید',
  default:
    'درخواست شما با خطا مواجه شده است. لطفاً دقایقی دیگر تلاش کنید. در صورت برطرف نشدن مشکل با پشتیبانی تماس بگیرید.',
};

export class ErrorUtils {
  static getErrorMessage(errorCode): string {
    if (errorCode in ERROR_MAP) {
      return ERROR_MAP[errorCode];
    }
    return ERROR_MAP.default;
  }

  static getDefaultErrorMessage(): string {
    return ERROR_MAP.default;
  }
}

export default ErrorUtils;
